In [1]:
import pandas as pd
import numpy as np
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report, accuracy_score
from sklearn.preprocessing import StandardScaler

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/rasyidev/well-known-datasets/main/bank_churn.csv")
df.head(2)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0

In [3]:
df[['CreditScore', 'Age', 'Balance', 'EstimatedSalary']] # ini yang akan disimpan ke X

      CreditScore  Age    Balance  EstimatedSalary
0             619   42       0.00        101348.88
1             608   41   83807.86        112542.58
2             502   42  159660.80        113931.57
3             699   39       0.00         93826.63
4             850   43  125510.82         79084.10
...           ...  ...        ...              ...
9995          771   39       0.00         96270.64
9996          516   35   57369.61        101699.77
9997          709   36       0.00         42085.58
9998          772   42   75075.31         92888.52
9999          792   28  130142.79         38190.78

[10000 rows x 4 columns]

In [6]:
df['Exited']

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [7]:
X = df[['CreditScore', 'Age', 'Balance', 'EstimatedSalary']]
y = df.Exited

## Scaling

In [10]:
ss = StandardScaler()
ss.fit_transform(X)

array([[-0.32622142,  0.29351742, -1.22584767,  0.02188649],
       [-0.44003595,  0.19816383,  0.11735002,  0.21653375],
       [-1.53679418,  0.29351742,  1.33305335,  0.2406869 ],
       ...,
       [ 0.60498839, -0.27860412, -1.22584767, -1.00864308],
       [ 1.25683526,  0.29351742, -0.02260751, -0.12523071],
       [ 1.46377078, -1.04143285,  0.85996499, -1.07636976]])

In [11]:
X = ss.fit_transform(X)

In [12]:
X

array([[-0.32622142,  0.29351742, -1.22584767,  0.02188649],
       [-0.44003595,  0.19816383,  0.11735002,  0.21653375],
       [-1.53679418,  0.29351742,  1.33305335,  0.2406869 ],
       ...,
       [ 0.60498839, -0.27860412, -1.22584767, -1.00864308],
       [ 1.25683526,  0.29351742, -0.02260751, -0.12523071],
       [ 1.46377078, -1.04143285,  0.85996499, -1.07636976]])

## Cross Validation

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

## Train

In [ ]:
knn = KNeighborsClassifier(n_neighbors=3)

In [ ]:
knn.fit(X_train, y)

In [ ]:
knn.predict(X, y)